app/controllers/my_files_controller.rb

SELECT "my_files".* FROM "my_files"
---
  def index
    @images = MyFile.all

INSERT INTO "my_files" ("image_updated_at", "image_file_name_file_name", "image_file_name_content_type", "image_content_type", "image", "image_file_name_file_size", "image_file_name_updated_at", "image_file_size", "image_file_name") VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '--- !ruby/object:ActionDispatch::Http::UploadedFile
---
  def create
    @image = MyFile.new(params[:my_file])
    if @image.save